## 데이터프레임 생성

In [1]:
import numpy as np 
import pandas as pd

print(np.__version__)
print(pd.__version__)

2.1.1
2.2.3

- 첫번째 방법 : 리스트 활용
- 두번째 방법 : 딕셔너리 활용 (강사 선호)

In [3]:
data = [
    ["039900", "알파코", 10000000, 10.05], 
    ["039910", "A", 500000, 1.05], 
    ["039900", "B", 1000, 1.28]
]

columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data = data, columns = columns)
df

     종목코드  종목명       현재가    등락률
0  039900  알파코  10000000  10.05
1  039910    A    500000   1.05
2  039900    B      1000   1.28

In [33]:
import pandas as pd
import random
import string


# Regenerating the dictionary where each key (종목코드, 종목명, 현재가, 등락률) has a list of values

data_dict = {
    "종목코드": [],
    "종목명": [],
    "현재가": [],
    "등락률": []
}

# Function to generate simpler 종목코드 and 종목명 ensuring the 종목코드 starts with '0'
def generate_code_name_for_dict(existing_codes):
    while True:
        code = '0' + ''.join(random.choices(string.digits, k=5))  # Ensure it starts with '0'
        name = ''.join(random.choices(string.ascii_uppercase, k=2))  # Simpler 종목명 with 2 letters
        if code not in existing_codes:
            return code, name

# Generating 10,000 rows of data
existing_codes_for_dict = set()

for _ in range(10000):
    code, name = generate_code_name_for_dict(existing_codes_for_dict)
    existing_codes_for_dict.add(code)
    current_price = random.randint(1000, 1000000)  # Simpler current price
    change_rate = round(random.uniform(-5, 5), 2)  # Simpler change rate
    
    data_dict["종목코드"].append(code)
    data_dict["종목명"].append(name)
    data_dict["현재가"].append(current_price)
    data_dict["등락률"].append(change_rate)

# Previewing a portion of the dictionary
data_dict_preview = {k: data_dict[k][:5] for k in data_dict}

df2 = pd.DataFrame(data_dict_preview)
df2

     종목코드 종목명     현재가   등락률
0  035315  EP  722660  3.10
1  013982  PG  800324 -3.14
2  006826  GV   86890 -2.03
3  001229  GN  660840  3.77
4  078091  QT  968910  4.79

In [29]:
df2.head(1)

     종목코드 종목명     현재가   등락률
0  088679  RK  490916 -0.51

In [30]:
df2.tail(1)

     종목코드 종목명     현재가   등락률
4  056518  WO  699562  2.88

In [34]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   종목코드    5 non-null      object
 1   종목명     5 non-null      object
 2   현재가     5 non-null      int64
 3   등락률     5 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 292.0+ bytes

In [35]:
df2.describe()

                 현재가       등락률
count       5.000000  5.000000
mean   647924.800000  1.298000
std    334203.984903  3.616749
min     86890.000000 -3.140000
25%    660840.000000 -2.030000
50%    722660.000000  3.100000
75%    800324.000000  3.770000
max    968910.000000  4.790000

In [36]:
data2 = {
    "종목코드" : ['039900', '039910', '039920'], 
    "종목명" : ["알파코", "A", "B"], 
    "현재가" : [10000000, 500000, 1000], 
    "등락률" : [10.05, 1.05, 1.28]
}

df2 = pd.DataFrame(data = data2)
df2

     종목코드  종목명       현재가    등락률
0  039900  알파코  10000000  10.05
1  039910    A    500000   1.05
2  039920    B      1000   1.28

In [20]:
df2 = df2.set_index("종목코드")
df2

        종목명       현재가    등락률
종목코드
039900  알파코  10000000  10.05
039910    A    500000   1.05
039920    B      1000   1.28

In [44]:
df2.reset_index(drop=True) # df2.reset_index()

     종목코드  종목명       현재가    등락률
0  039900  알파코  10000000  10.05
1  039910    A    500000   1.05
2  039920    B      1000   1.28

In [47]:
from pandas import DataFrame

data = [
    ["알파코", 10000000, 10.05], 
    ["A", 500000, 1.05], 
    ["B", 1000, 1.28]
]

index = ["039900", "039910", "039900"]
columns = ["종목명", "현재가", "등락률"]
df = DataFrame(data=data, index=index, columns=columns)
df

        종목명       현재가    등락률
039900  알파코  10000000  10.05
039910    A    500000   1.05
039900    B      1000   1.28

In [55]:
df.index

Index(['039900', '039910', '039900'], dtype='object')

In [56]:
df.values

array([['알파코', 10000000, 10.05],
       ['A', 500000, 1.05],
       ['B', 1000, 1.28]], dtype=object)

In [57]:
df.현재가

039900    10000000
039910      500000
039900        1000
Name: 현재가, dtype: int64

In [58]:
df['현재가']

039900    10000000
039910      500000
039900        1000
Name: 현재가, dtype: int64

In [59]:
df[['현재가']]

             현재가
039900  10000000
039910    500000
039900      1000

## 로우 인덱싱
- loc, iloc
  + loc : Label를 기준으로 인덱싱
  + iloc : index를 기준으로 인덱싱

In [61]:
import seaborn as sns

sns.__version__

'0.13.2'

In [63]:
iris = sns.load_dataset("iris")
iris.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

In [70]:
iris.loc[[0, 9], ["sepal_width", "species"]]

   sepal_width species
0          3.5  setosa
9          3.1  setosa

In [72]:
iris.iloc[[0, 9], [1, 4]]

   sepal_width species
0          3.5  setosa
9          3.1  setosa

In [85]:
# 일종의 조건식
# 값을 가져오고 싶다면, True값만 가져옴
# iris['sepal_width'] > 3.5
result = iris.loc[iris['sepal_width'] >= 4.0, :].reset_index(drop=True)
result

   sepal_length  sepal_width  petal_length  petal_width species
0           5.8          4.0           1.2          0.2  setosa
1           5.7          4.4           1.5          0.4  setosa
2           5.2          4.1           1.5          0.1  setosa
3           5.5          4.2           1.4          0.2  setosa

In [84]:
iris.loc[iris['sepal_width'] >= 4.0, ["species"]].reset_index(drop=True)

  species
0  setosa
1  setosa
2  setosa
3  setosa

In [92]:
# 문자열 기반으로 조회
result = iris.loc[iris['species'] == "setosa", :].reset_index(drop=True)

In [97]:
iris['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [108]:
# 다중 조건
# & : AND 연산자
# | : OR 연산자
# iris.loc[(iris['species'] == "virginica") & (iris['sepal_width'] >= 3.2), :]
iris.loc[(iris['species'] == "virginica") &
         (iris['sepal_width'] >= 3.2) & 
         (iris['petal_length'] >= 6.2), :].reset_index(drop=True).head(1)

   sepal_length  sepal_width  petal_length  petal_width    species
0           7.7          3.8           6.7          2.2  virginica

## 컬럼 추가하기

In [119]:
iris2 = iris.copy()
iris2['newCol'] = 0
iris2['sepals'] = iris2['sepal_length'] ** iris2['sepal_width']
iris2.head(1)

,sepal_length,sepal_width,petal_length,petal_width,species,newCol,sepals
0,5.1,3.5,1.4,0.2,setosa,0,299.568135

In [133]:
from pandas import DataFrame

data = [
    ["알파코", 10000000, 10.05], 
    ["A", 500000, 1.05], 
    ["B", 1000, 1.28]
]

index = ["039900", "039910", "039900"]
columns = ["종목명", "현재가", "등락률"]
df = DataFrame(data=data, index=index, columns=columns)
df

        종목명       현재가    등락률
039900  알파코  10000000  10.05
039910    A    500000   1.05
039900    B      1000   1.28

In [134]:
# axis = 0, 행을 처리한다. 
# axis = 1, 열을 처리한다. 
df2 = df.drop("종목명", axis = 1)
df2

             현재가    등락률
039900  10000000  10.05
039910    500000   1.05
039900      1000   1.28

In [131]:
df.drop("종목명", axis = 1)

In [138]:
# 컬럼명 변경
from pandas import DataFrame

data = [
    ["알파코", 10000000, 10.05], 
    ["A", 500000, 1.05], 
    ["B", 1000, 1.28]
]

index = ["039900", "039910", "039900"]
columns = ["종목명", "현재가", "등락률"]
df = DataFrame(data=data, index=index, columns=columns)
df2 = df.rename(columns = {'종목명' : 'code', '현재가' : 'current'})
df2

       code   current    등락률
039900  알파코  10000000  10.05
039910    A    500000   1.05
039900    B      1000   1.28

In [140]:
data = [
    ["1,000", "1,100", '1,510'],
    ["1,410", "1,420", '1,790'],
    ["850", "900", '1,185'],
]
columns = ["03/02", "03/03", "03/04"]
df = DataFrame(data=data, columns=columns)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   03/02   3 non-null      object
 1   03/03   3 non-null      object
 2   03/04   3 non-null      object
dtypes: object(3)
memory usage: 204.0+ bytes

## 데이터 내보내기

In [142]:
iris.to_csv("iris_240930.csv", index=False)

In [147]:
iris.to_excel("iris_excel_240930.xlsx", index=False)

## 데이터 불러오기

In [145]:
df = pd.read_csv("iris_240930.csv")
df.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

In [151]:
df = pd.read_csv("test/iris_240930.csv")
df.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

In [148]:
excel_df = pd.read_excel("iris_excel_240930.xlsx")
excel_df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]